In [147]:
import numpy as np 
import pandas as pd

In [148]:
df = pd.read_csv('Salaries.csv')
df

C:\Users\Loay_Alrazi\AppData\Local\Temp\ipykernel_26572\3499069451.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [149]:
df.head(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

In [150]:
df.describe().round(2)

              Id   TotalPay  TotalPayBenefits       Year  Notes
count  148654.00  148654.00         148654.00  148654.00    0.0
mean    74327.50   74768.32          93692.55    2012.52    NaN
std     42912.86   50517.01          62793.53       1.12    NaN
min         1.00    -618.13           -618.13    2011.00    NaN
25%     37164.25   36169.00          44065.65    2012.00    NaN
50%     74327.50   71426.61          92404.09    2013.00    NaN
75%    111490.75  105839.14         132876.45    2014.00    NaN
max    148654.00  567595.43         567595.43    2014.00    NaN

# What is the Avarage BasePay?

In [151]:
df['BasePay']

0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object

In [152]:
print(df['BasePay'].dtype)
print(df['BasePay'].unique)

object
<bound method Series.unique of 0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object>

In [153]:
# يحسب أي خلية تحتوي على النص بغض النظر عن حالة الأحرف
count = df['BasePay'].str.contains('Not Provided', case=False, na=False).sum()
print(count)

4

In [154]:
df["BasePay"] = df["BasePay"].replace('Not Provided', 0 )

In [155]:
df['BasePay']

0         167411.18
1         155966.02
2         212739.13
3           77916.0
4          134401.6
            ...
148649         0.00
148650            0
148651            0
148652            0
148653         0.00
Name: BasePay, Length: 148654, dtype: object

In [156]:
df['BasePay']=df['BasePay'].fillna(0).astype(float)

In [157]:
df['BasePay']

0         167411.18
1         155966.02
2         212739.13
3          77916.00
4         134401.60
            ...
148649         0.00
148650         0.00
148651         0.00
148652         0.00
148653         0.00
Name: BasePay, Length: 148654, dtype: float64

In [158]:
df['BasePay'].mean()

66053.72928807836

# What is the highest amount of OvertimePay in the dataset?

In [159]:
df['OvertimePay']

0                  0.0
1            245131.88
2            106088.18
3             56120.71
4               9737.0
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: OvertimePay, Length: 148654, dtype: object

In [160]:
# يحسب أي خلية تحتوي على النص بغض النظر عن حالة الأحرف
count = df['OvertimePay'].str.contains('Not Provided', case=False, na=False).sum()
print(count)

4

In [161]:
# يحسب عدد الخلايا التي تحتوي على هذه القيمة في كل الجدول
total_count = (df == 'Not Provided').sum().sum()
print(f"الإجمالي في كل الجدول: {total_count}")

الإجمالي في كل الجدول: 14

In [162]:
# الإبقاء فقط على الصفوف التي لا تساوي 'Not Provided'
df = df[df['BasePay'] != 'Not Provided']

In [163]:
# حذف أي صف يحتوي على 'Not Provided' في أي عمود
df = df[~(df == 'Not Provided').any(axis=1)]

In [164]:
df['OvertimePay']

0               0.0
1         245131.88
2         106088.18
3          56120.71
4            9737.0
            ...
148645         0.00
148647         0.00
148648         0.00
148649         0.00
148653         0.00
Name: OvertimePay, Length: 148648, dtype: object

In [165]:
#  تحويل الأعمدة المستهدفة لأرقام لنتمكن من حساب المتوسط والقمة وغيرها

df['OvertimePay'] = pd.to_numeric(df['OvertimePay'])

print("المتوسط:", df['BasePay'].mean())
print("أعلى قيمة:", df['BasePay'].max())

المتوسط: 66055.45257036759
أعلى قيمة: 319275.01

# What is the job title of JOSEPH DRISCOLL? Note: Use all caps, otherwise you may get an answer that dosn't match up (there is a lowercase Joseph Driscoll).

In [166]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

# How much does JOSEPH DRISCOLL make (including benefits)?

In [167]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

# What is the name of highest paid person(including benfits)?

In [168]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [169]:

df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

# What is the name of lowest paid person (including benefits)? Do you notice somthing strange about how much he or she is paid?

In [170]:

df[df['TotalPayBenefits']==df['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

# What was the average (mean) BasePay of all employees per year? (2011-2014)?

In [171]:
df['Year'].isnull()

0         False
1         False
2         False
3         False
4         False
          ...
148645    False
148647    False
148648    False
148649    False
148653    False
Name: Year, Length: 148648, dtype: bool

In [172]:
# df.groupby('Year').mean()['BasePay']

# How many unique job titles are there?

# what are the top 5 most common jobs?

# How many job Taitles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)